# config/constants.py

# 模板固有短语列表，可以扩展
TEMPLATE_PHRASES = [
    "用户行为分析", "功能细项",
    "互联网搜索需求", "基础数据",
    "基表", "基础数据", "样张模板", "XX批处理",
    "批处理要素说明", "批处理执行频率", "计算公式和案例", "非功能性需求",
    "用户量", "运行维护",
    "终端设备",
    "网络需求", "并发量", "业务量", "终端设备",
    "其他"
]

# 正文部分模糊匹配过滤
CONTENT_FILTER_FUZZY = ["【注：",
                        "不涉及",
                        "表格：填写页面字段描述、页面事件和页面规则，字段描述初始数据来源于业务需求，可修改。",
                        "V1.0",
                        "举例",
                        ]

# 正文部分精准匹配过滤
CONTENT_FILTER_EXACT = ["需求规格说明书",
                        "版本记录",
                        "细项类别只能选填“业务数据”或“业务功能”；",
                        "业务数据的细项名称只能以“信息”、“数据”、“配置”或类似名词为后缀；",
                        "业务功能的细项名称只能以“信息的管理”、“数据的增删改查”、“配置的维护”等有对象的动词为后缀，新增、删除、查询、修改可单列为一个细项；",
                        "变化说明一般选“新增”、“已有但需修改”，确实没有变化的业务数据或业务功能，可填无变化，也可不填写该细项；",
                        "备注用做补充说明，按需填写即可；",
                        "接口功能和批处理功能在相应章节描述即可，不需要在此填写】",
                        ]

CLEAN_FLAG = ["需求规格说明书", ]

design_methods = [
    "等价类划分",
    "边界值分析",
    "决策表",
    "状态转换",
    "错误推测",
    "场景法",
    "因果图测试",
    "正交分析法"
]